## Env: `staging`
#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`
<details><summary>Show Plan</summary>

```

module.app_runner.data.terraform_remote_state.code_registry: Reading...
module.app_runner.data.terraform_remote_state.code_registry: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.app_runner.aws_apprunner_service.il01_api will be created
  + resource "aws_apprunner_service" "il01_api" {
      + arn                            = (known after apply)
      + auto_scaling_configuration_arn = (known after apply)
      + id                             = (known after apply)
      + service_id                     = (known after apply)
      + service_name                   = "il01_api_stg"
      + service_url                    = (known after apply)
      + status                         = (known after apply)
      + tags                           = {
          + "Env" = "stg"
        }
      + tags_all                       = {
          + "Env" = "stg"
        }

      + health_check_configuration (known after apply)

      + instance_configuration {
          + cpu    = "0.25 vCPU"
          + memory = "0.5 GB"
        }

      + network_configuration {
          + ip_address_type = "IPV4"

          + egress_configuration (known after apply)

          + ingress_configuration {
              + is_publicly_accessible = true
            }
        }

      + source_configuration {
          + auto_deployments_enabled = false

          + image_repository {
              + image_identifier      = "public.ecr.aws/aws-containers/hello-app-runner:latest"
              + image_repository_type = "ECR_PUBLIC"

              + image_configuration {
                  + port = "8080"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Action: `pull_request`*